package Sem5;

// 1. Этот класс используется для выполнения математических операций связи и связан с презентером,
// от кторого он получает данные и которому передает результат.
// В других классах такого функционала нет. 
//Следовательно можно сказать что тут работает 1 й принцип - принцип единственной отвертственности.
// 2. Если нам понадобится расширить функционал, то мы добавим создадим новый метод (дополнил ваш класс методом -, *, / ), 
// Не внося изменений в существющий функционал.
///Это второй принцияп - открытости/закрытости.
// 3. Интерфейсов нет, но класс несет свой специфилизированный фунционал.
//Так что можно увидеть 4й принцип - принцип разделения ответственности..



// Получили данные от презентера, выполнгили математическую операцию. Передали результат презентеру.
public class CalculatorModel {
private int result;

public void add(int number1, int number2) {
    result = number1 + number2;
}

public void subtrac(int number1, int number2) {
    result = number1 - number2;
}
public void multip(int number1, int number2) {
    result = number1 * number2;
}
public void divis(int number1, int number2) {
    result = number1 / number2;
}

public int getResult() {
    return result;
}
}