package Sem5;
// 1. Этот класс используется для создание экземпляров модели, представления и презентера. И для запуска/входа программы
// В других классах такого функционала нет. 
//Следовательно можно сказать что тут работает 1 й принцип - принцип единственной отвертственности.
// 2. Если нам понадобится расширить функционал, то мы добавим создадим новый класс, создадим ноывый экземпляр.
// Не внося изменений в существющий функционал.
///Это второй принцияп - открытости/закрытости.
// 3. Интерфейсов нет, но каждый класс несет свой специфилизированный фунционал.
//Так что можно увидеть 4й принцип - принцип разделения интерфейсов.



public class Main {
public static void main(String[] args) {
// Создание экземпляров модели, представления и презентера
CalculatorModel model = new CalculatorModel();
CalculatorView view = new CalculatorView();
CalculatorPresenter presenter = new CalculatorPresenter(model, view);

    
    presenter.choice(); // Запуск программы
}
}
