
// 1. Этот класс используется для вывода даннх в консоль, все.
//Следовательно можно сказать что тут работает 1 й принцип - принцип единственной отвертственности.
// 2. Если нам понадобится расширить функционал, то мы добавим создадим новый метод (например вывод на монитор)
// Не внося изменений в существющий функционал.
///Это второй принцияп - открытости/закрытости.
// 3. Интерфейсов нет, но класс несет свой специфилизированный фунционал.
//Так что можно увидеть 4й принцип - принцип разделения ответственности..




package Sem4;

// Получаетм данные от ведущего файла и выводим на печать.Все!
public class Output {
    
    public <T> void printArray(T[] array){
        for(T item: array){
            
            System.out.print(" " + item);
        }
        System.out.println();
    }
}
